Ran Plan for 3 projects:

1. project: `platform` dir: `2.platform` workspace: `default`
1. project: `apps-prod` dir: `4.apps` workspace: `prod`
1. project: `apps-staging` dir: `4.apps` workspace: `staging`

### 1. project: `platform` dir: `2.platform` workspace: `default`
**Plan Error**
```
the default workspace at path 2.platform is currently locked by another command that is running for this pull request.
Wait until the previous command is complete and try again
```

---
### 2. project: `apps-prod` dir: `4.apps` workspace: `prod`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 init -input=false -backend-config=backend.tfvars" in "/atlantis-data/repos/wangzitian0/infra/272/prod/4.apps": exit status 1
infra-flash-commit:5be2097 

Backend config unchanged. Keeping cache.


Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/vault from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of alekc/kubectl from the dependency lock file
- Using previously-installed hashicorp/random v3.7.2
- Installing hashicorp/vault v4.8.0...
- Using previously-installed hashicorp/kubernetes v2.38.0
- Using previously-installed alekc/kubectl v2.1.3
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/vault v4.8.0: open
│ /atlantis-data/plugin-cache/registry.terraform.io/hashicorp/vault/4.8.0/linux_amd64/terraform-provider-vault_v4.8.0_x5:
│ text file busy
╵


```
</details>

---
### 3. project: `apps-staging` dir: `4.apps` workspace: `staging`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 plan -input=false -refresh -out \"/atlantis-data/repos/wangzitian0/infra/272/staging/4.apps/apps-staging-staging.tfplan\"" in "/atlantis-data/repos/wangzitian0/infra/272/staging/4.apps": exit status 1
infra-flash-commit:5be2097 

Backend config unchanged. Keeping cache.

terraform_data.domain_config_check: Refreshing state... [id=76752d53-0901-ad4c-2111-13596e49c371]
random_id.kubero_webhook_secret: Refreshing state... [id=9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8]
kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system-staging]
random_id.kubero_session_secret: Refreshing state... [id=e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw]
data.vault_kv_secret_v2.kubero: Reading...
kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system-staging/deployments/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system-staging/roles/kubero-operator-leader-election-role]
kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system-staging/rolebindings/kubero-operator-leader-election-rolebinding]
kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/serviceaccounts/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/services/kubero-operator-controller-manager-metrics-service]
kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/configmaps/kubero-operator-manager-config]
kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
kubernetes_namespace.kubero: Refreshing state... [id=kubero-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # kubernetes_service_account.kubero will be created
  + resource "kubernetes_service_account" "kubero" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero"
          + namespace        = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.kubero_session_secret will be destroyed
  # (because random_id.kubero_session_secret is not in configuration)
  - resource "random_id" "kubero_session_secret" {
      - b64_std     = "e58531z2HdrLNZ9i+1GmJGKefa9im2GzUR1u8LRDTvw=" -> null
      - b64_url     = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
      - byte_length = 32 -> null
      - dec         = "55915808480441380053427832712491152012099215374657984171750255703449988714236" -> null
      - hex         = "7b9f39df5cf61ddacb359f62fb51a624629e7daf629b61b3511d6ef0b4434efc" -> null
      - id          = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
    }

  # random_id.kubero_webhook_secret will be destroyed
  # (because random_id.kubero_webhook_secret is not in configuration)
  - resource "random_id" "kubero_webhook_secret" {
      - b64_std     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ+a0CX0Fv3vjK8+p8=" -> null
      - b64_url     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
      - byte_length = 32 -> null
      - dec         = "111612930202753751380578856482081899563019285496294477810649772987267428448927" -> null
      - hex         = "f6c2ae080b0219280d73daf6cb4360f5f1db58467e6b4097d05bf7be32bcfa9f" -> null
      - id          = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
╷
│ Error: no secret found at "secret/data/data/kubero"
│ 
│   with data.vault_kv_secret_v2.kubero,
│   on 1.kubero.tf line 104, in data "vault_kv_secret_v2" "kubero":
│  104: data "vault_kv_secret_v2" "kubero" {
│ 
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`